{
  "lights.smile": "Lets you use the blocks in the neopixel category for better control over the smile/rainbow.",
  "lights.smileCycleRainbow": "Displays the colors of the rainbow on the lights and cycles through them",
  "lights.smileCycleRainbowTime": "Displays the colors of the rainbow on the lights and cycles through them based on times",
  "lights.smileCycleRainbowTime|param|cycle_length": "how long (in ms) the cycling will last for: eg: 3000",
  "lights.smileCycleRainbowTime|param|delay": "how long to wait(in ms) before cycling; eg: 100, 200",
  "lights.smileCycleRainbow|param|nbcycles": "how many times the rainbow will do a full cycle; eg: 3, 5, 10",
  "lights.smileRainbow": "Will display a rainbow of colors on the smile lights",
  "lights.smileShowGraph": "Use the smile lights to display a line graph of a certain value on a graph of 0 to Max value",
  "lights.smileShowGraph|param|graph_max": "the maximum value, which doesn't have to be a multiple of 7; eg: 7",
  "lights.smileShowGraph|param|graph_value": "the value to be displayed; eg: 1",
  "lights.whichEye": "Lets you use the blocks in the neopixel category for better control over the eyes.",
  "remote.onRemoteControl": "Use this block on the GiggleBot to control it with a second micro:bit",
  "remote.remoteControl": "Use this block to turn a second micro:bit into a remote controller.\nEasiest approach is to put this block inside a \"Forever\" block.\nYou will need to use the \"remote receiver mode\" block on the GiggleBot itself.",
  "remote.remoteControlAction": "Put this block inside of the 'remotely controlled gigglebot' to follow all comands received via remote control.",
  "remote.setGroup": "In order to have a remote micro:bit control the GiggleBot, both of them\nmust be in the same radio group - or remote group. You can use either this\nblock or the \"radio set group\" block found under Radio. \nThe two blocks are the same thing.\nMake sure your set of remote microbits and GiggleBots is assigned a unique\ngroup, especially if there are many GiggleBot pairs around you.",
  "remote.setGroup|param|id": "eg: 1"
}
